/**
 * Created by Thanh.Vo on 5/6/2019.
 */
cc.LabelTTF._wordRex = /([a-zA-Z0-9ÁáÀàÂâÃãǍǎĀāĂăĐđÉéÈèÊêÍíÌìĨĩÓóÒòÔôÕõÚúÙùÝýẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽếẾỀềỂểỄễỆệỉỈỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợƠơỤụỦủỨứỪừỬửỮữỰựƯưỲỳỴỵỶỷỸỹ]+|\S)/;
cc.LabelTTF._symbolRex = /^[!,.:;}\]%\?>、‘“》？。，！]/;
cc.LabelTTF._lastWordRex = /([a-zA-Z0-9ÁáÀàÂâÃãǍǎĀāĂăĐđÉéÈèÊêÍíÌìĨĩÓóÒòÔôÕõÚúÙùÝýẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽếẾỀềỂểỄễỆệỉỈỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợƠơỤụỦủỨứỪừỬửỮữỰựƯưỲỳỴỵỶỷỸỹ]+|\S)$/;
cc.LabelTTF._lastEnglish = /[a-zA-Z0-9ÁáÀàÂâÃãǍǎĀāĂăĐđÉéÈèÊêÍíÌìĨĩÓóÒòÔôÕõÚúÙùÝýẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽếẾỀềỂểỄễỆệỉỈỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợƠơỤụỦủỨứỪừỬửỮữỰựƯưỲỳỴỵỶỷỸỹ]+$/;
cc.LabelTTF._firsrEnglish = /^[a-zA-Z0-9ÁáÀàÂâÃãǍǎĀāĂăĐđÉéÈèÊêÍíÌìĨĩÓóÒòÔôÕõÚúÙùÝýẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽếẾỀềỂểỄễỆệỉỈỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợƠơỤụỦủỨứỪừỬửỮữỰựƯưỲỳỴỵỶỷỸỹ]/;